//☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆//
// 詳細   ：レンダリングスクリーン（レンダリング先画像）のシステムの基底クラス
// 説明   ：書き込むレンダリング先画像の設定や、レンダリング先画像を画像に変換またはシェーダーによる画像としての使用をサポートする
// 作成者 ：髙坂龍誠
//☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆//


// ☆ ファイルひらき ☆ //
#include "C_Rendering_Screen_Data_Base.h"


// ☆ ネームスペースの省略 ☆ //
using namespace RENDERING::API::INSTANCE;


//-☆- 初期化と終了時 -☆-//

//☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆//
// 詳細   ：コンストラクタ
// 引数   ：void
// 戻り値 ：なし
//☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆//
C_Rendering_Screen_Data_Base::C_Rendering_Screen_Data_Base(void)
{
	return;
}


//☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆//
// 詳細   ：デストラクタ
// 引数   ：void
// 戻り値 ：なし
//☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆=☆//
C_Rendering_Screen_Data_Base::~C_Rendering_Screen_Data_Base(void)
{
	return;
}


